tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
brew "mas"
brew "git"
brew "vim"
brew "zsh"
brew "jq"
brew "fzf"
brew "tmux"
brew "gitlab-ci-local"
brew "go"
brew "yt-dlp"
brew "hugo"
brew "bat"

# Slurm Gitlab course
brew "cfssl"

# Appium dependencies
brew "carthage"

# Evaluation
brew "asciidoctor"
brew "gitleaks"
brew "gpg"
brew "glab"


cask "1password"
cask "adguard"
cask "cloudflare-warp"
cask "docker"
cask "font-iosevka-nerd-font"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "lens"
cask "macvim"
cask "macupdater"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "nrlquaker-winbox"
cask "plex"
cask "postman"
cask "teamviewer"
cask "transmission"
cask "xld"
cask "intellij-idea"
cask "obs"

# Evaluation
cask "goland"
cask "ukelele"
# cask "karabiner-elements"
cask "ngrok"
cask "imageoptim"
cask "shottr"
cask "appium-inspector"
cask "android-studio"
cask "1password-cli"
cask "gitdock"

# Safari extensions
mas "1Password for Safari", id: 1569813296
mas "Evernote Web Clipper", id: 1481669779
mas "Octotree", id: 1457450145

mas "Day One", id: 1055511498
mas "Evernote", id: 406056744
mas "Focus", id: 777233759
mas "Keynote", id: 409183694
mas "Monosnap - screenshot editor", id: 540348655
mas "Movist", id: 461788075
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ReadKit", id: 588726889
mas "Telegram", id: 747648890
mas "ScreenPointer", id: 1368204906

# Evaluation
mas "Sourcegraph for Safari", id: 1543262193
mas "Pure Paste", id: 1611378436
mas "AnkiApp Flashcards", id: 689185915
mas "Xcode", id: 497799835

